author: Jared Atkinson (@jaredcatkinson)
channel: ''
date: 02/21/2019
description: ''
details: 'Login and other authentication events

  '
eventData:
  AccountDomain:
    Description: Domain of the account
    Sample Value: ''
    Standard Name: user_domain
    Type: string
  AccountName:
    Description: User name of the account
    Sample Value: ''
    Standard Name: user_name
    Type: string
  AccountSid:
    Description: Security Identifier (SID) of the account
    Sample Value: ''
    Standard Name: user_sid
    Type: string
  ActionType:
    Description: Type of activity that triggered the event
    Sample Value: ''
    Standard Name: action_type
    Type: string
  AdditionalFields:
    Description: Additional information about the event in JSON array format
    Sample Value: ''
    Standard Name: additional_fields
    Type: string
  AppGuardContainerId:
    Description: Identifier for the virtualized container used by Application Guard
      to isolate browser activity
    Sample Value: ''
    Standard Name: app_guard_container_id
    Type: string
  ComputerName:
    Description: Fully qualified domain name (FQDN) of the machine
    Sample Value: ''
    Standard Name: computer_name
    Type: string
  EventTime:
    Description: Date and time when the event was recorded
    Sample Value: ''
    Standard Name: event_date_creation
    Type: date
  InitiatingProcessAccountDomain:
    Description: Domain of the account that ran the process responsible for the event
    Sample Value: ''
    Standard Name: process_user_domain
    Type: string
  InitiatingProcessAccountName:
    Description: User name of the account that ran the process responsible for the
      event
    Sample Value: ''
    Standard Name: process_user_name
    Type: string
  InitiatingProcessAccountSid:
    Description: Security Identifier (SID) of the account that ran the process responsible
      for the event
    Sample Value: ''
    Standard Name: process_user_sid
    Type: string
  InitiatingProcessCommandLine:
    Description: Command line used to run the process that initiated the event
    Sample Value: ''
    Standard Name: process_command_line
    Type: string
  InitiatingProcessCreationTime:
    Description: Date and time when the process that initiated the event was started
    Sample Value: ''
    Standard Name: process_creation_time
    Type: date
  InitiatingProcessFileName:
    Description: Name of the process that initiated the event
    Sample Value: ''
    Standard Name: process_name
    Type: string
  InitiatingProcessFolderPath:
    Description: Folder containing the process (image file) that initiated the event
    Sample Value: ''
    Standard Name: process_path
    Type: string
  InitiatingProcessId:
    Description: Process ID (PID) of the process that initiated the event
    Sample Value: ''
    Standard Name: process_id
    Type: int
  InitiatingProcessIntegrityLevel:
    Description: Integrity level of the process that initiated the event. Windows
      assigns integrity levels to processes based on certain characteristics, such
      as if they were launched from an internet download. These integrity levels influence
      permissions to resources.
    Sample Value: ''
    Standard Name: process_integrity_level
    Type: string
  InitiatingProcessMD5:
    Description: MD5 hash of the process (image file) that initiated the event
    Sample Value: ''
    Standard Name: process_hash_md5
    Type: string
  InitiatingProcessParentCreationTime:
    Description: Date and time when the parent of the process responsible for the
      event was started
    Sample Value: ''
    Standard Name: process_parent_creation_time
    Type: date
  InitiatingProcessParentFileName:
    Description: Name of the parent process that spawned the process responsible for
      the event
    Sample Value: ''
    Standard Name: process_parent_name
    Type: string
  InitiatingProcessParentId:
    Description: Process ID (PID) of the parent process that spawned the process responsible
      for the event
    Sample Value: ''
    Standard Name: process_parent_id
    Type: int
  InitiatingProcessSHA1:
    Description: SHA-1 of the process (image file) that initiated the event
    Sample Value: ''
    Standard Name: process_hash_sha1
    Type: string
  InitiatingProcessTokenElevation:
    Description: Token type indicating the presence or absence of User Access Control
      (UAC) privilege elevation applied to the process that initiated the event
    Sample Value: ''
    Standard Name: process_token_elevation
    Type: string
  LogonId:
    Description: Identifier for a logon session. This identifier is unique on the
      same machine only between restarts.
    Sample Value: ''
    Standard Name: logon_id
    Type: string
  LogonType:
    Description: Type of logon session
    Sample Value: ''
    Standard Name: logon_type
    Type: string
  MachineId:
    Description: Unique identifier for the machine in the service
    Sample Value: ''
    Standard Name: machine_id
    Type: string
  RemoteComputerName:
    Description: Name of the machine that performed a remote operation on the affected
      machine. Depending on the event being reported, this name could be a fully-qualified
      domain name (FQDN), a NetBIOS name, or a host name without domain information.
    Sample Value: ''
    Standard Name: dst_host_name
    Type: string
  RemoteIP:
    Description: IP address that was being connected to
    Sample Value: ''
    Standard Name: dst_ip
    Type: string
  RemoteIPType:
    Description: Type of IP address, for example Public, Private, Reserved, Loopback,
      Teredo, FourToSixMapping, and Broadcast
    Sample Value: ''
    Standard Name: remote_ip_type
    Type: string
  RemotePort:
    Description: TCP port on the remote device that was being connected to
    Sample Value: ''
    Standard Name: dst_port
    Type: int
  ReportId:
    Description: Event identifier based on a repeating counter. To identify unique
      events, this column must be used in conjunction with the ComputerName and EventTime
      columns.
    Sample Value: ''
    Standard Name: report_id
    Type: long
logtype: windowsdefenderatp
name: ''
platform: windows
provider: ''
providerGUID: ''
title: ''
